{
    "character": [
        {
            "id": 1,
            "name": "Amber",
            "quote": "Outrider Amber, at the ready!",
            "cv": "Iwami Manaka",
            "description": "A perky, straightforward girl, who is also the only Outrider of the Knights of Favonius. Her amazing mastery of the glider has made her a three-time winner of the Gliding Champion in Mondstadt. As a rising star within the Knights of Favonius, Amber is always ready for any challenging tasks.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20191009/2019100914372396510.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=1",
            "element": "Pyro",
            "weapon": "Bow",
            "rating": 4
        },
        {
            "id": 2,
            "name": "Baizhu",
            "quote": "Unknown",
            "cv": "Kōji Yusa",
            "description": "Unknown",
            "image": "https://vignette.wikia.nocookie.net/gensin-impact/images/a/a5/Character_Baizhu_Portrait.png/revision/latest?cb=20200820104816",
            "city": "Liyue",
            "url": "https://genshin-impact.fandom.com/wiki/Baizhu",
            "element": "Dendro",
            "weapon": "Unknown",
            "rating": 512
        },
        {
            "id": 3,
            "name": "Barbara",
            "quote": "The best magic is diligence.",
            "cv": "Kito Akari",
            "description": "The Deaconess of the Favonius Church and a shining starlet adored by all. Although the concept of a starlet is rather novel in a city of bards, the people of Mondstadt love Barbara nonetheless. I owe everything to the city's spirit of freedom. — Barbara, regarding her popularity.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200609/2020060915101631868.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=4",
            "element": "Hydro",
            "weapon": "Catalyst",
            "rating": 4
        },
        {
            "id": 4,
            "name": "Beidou",
            "quote": "I'm the captain, so you can be my first mate! Deal?",
            "cv": "Koshimizu Ami",
            "description": "Captain of the Crux, with quite the reputation in Liyue. There are those who say she can split mountains and part the sea. Others say she draws lightning through her sword. Some say that even the mightiest of sea beasts are no match for her. For those not from Liyue, it may sound like a hearty joke, but those that have sailed with her will say— 'No matter what sea beasts there may be, Beidou will be sure to split them all in two.'",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200227/2020022720085973518.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=1",
            "element": "Electro",
            "weapon": "Claymore",
            "rating": 4
        },
        {
            "id": 5,
            "name": "Bennett",
            "quote": "Weather's not bad today... Oh crud, i jinxed it! Now it's bound to rain.",
            "cv": "Ousaka Ryouta",
            "description": "The few young adventurers that the Mondstadt Adventurers' Guild has always find themselves tangled up in baffling bouts of bad luck. He is the only active member of his own adventure group, known as 'Benny's Adventure Team,' after all the other members decided to 'take leave' following a series of unfortunate incidents. As a result, the team is currently on the verge of being dissolved. Being unable to break the poor boy's heart, Katheryne of the Adventurers' Guild has kept 'Benny's Adventure Team' on the books, whilst also hiding from him the fact that all the other members have long since officially left the team.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200312/2020031220001589124.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=9",
            "element": "Pyro",
            "weapon": "Sword",
            "rating": 4
        },
        {
            "id": 6,
            "name": "Childe",
            "quote": "If your plan is to get the best of me... I'm looking forward to watching you try.",
            "cv": "Ryōhei Kimura",
            "description": "Childe is one of the Fatui's Eleven Fatui Harbingers who traveled to Liyue to head the funding for the city's finances",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20201103/2020110321160453386.png",
            "city": "Snezhnaya",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=8",
            "element": "Hydro",
            "weapon": "Bow",
            "rating": 512
        },
        {
            "id": 7,
            "name": "Chongyun",
            "quote": "Once I have rid this world of all evil spirits, I... I will break with my abstinence, and go to the hot springs!",
            "cv": "Saito Soma",
            "description": "An exorcist who roams the land with Liyue as his base of operations, evil spirits fleeing wherever he goes. As the heir to a clan of exorcists, he has always possessed abilities superior to most. However, these abilities are not the result of training, but of an inborn trait — congenital positivity.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200602/2020060220172055224.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=5",
            "element": "Cryo",
            "weapon": "Claymore",
            "rating": 4
        },
        {
            "id": 8,
            "name": "Diluc",
            "quote": "Eyes forward, to the new dawn.",
            "cv": "Ono Kenshou",
            "description": "As the wealthiest gentleman in Mondstadt, the ever-dapper Diluc always presents himself as the epitome of perfection. But behind the courteous visage burns a zealous soul that has sworn to protect Mondstadt at all costs, allowing him to mercilessly vanquish all who threaten his city.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200609/2020060915105884221.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=5",
            "element": "Pyro",
            "weapon": "Claymore",
            "rating": 5
        },
        {
            "id": 9,
            "name": "Diona",
            "quote": "Diona, Bartender of the Cat's Tail! I charge a hefty fee for private events... huh? You didn't come here for a drink?",
            "cv": "Ya Nuo",
            "description": "The incredibly popular bartender of the Cat's Tail tavern, rising star of Mondstadt's wine industry, and the greatest challenger to its traditional powerhouses. A feisty feline young lady from Springvale, any drink mixed by Diona's hand tastes delicious beyond belief. Yet given her extreme distaste for alcohol, is her talent a blessing or a curse?",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20201106/2020110618565219627.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=14",
            "element": "Cryo",
            "weapon": "Bow",
            "rating": 4
        },
        {
            "id": 10,
            "name": "Fischl",
            "quote": "You are as I am, a traveler from another world.",
            "cv": "Uchida Maaya",
            "description": "A mysterious girl who calls herself 'Prinzessin der Verurteilung' and travels with a night raven named Oz. Through her unique abilities, eccentric character, and (while she would never admit it herself) hard work, Fischl has become a rising star among the Adventurers' Guild's investigators, earning the recognition of all.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200402/2020040211240853891.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=11",
            "element": "Electro",
            "weapon": "Bow",
            "rating": 4
        },
        {
            "id": 11,
            "name": "Jean",
            "quote": "Wind, hear me!",
            "cv": "Saito Chiwa",
            "description": "As the Acting Grand Master of the Knights, Jean has always been devoted to her duties and maintaining peace in Mondstadt. She had taken precautions long before the onset of Stormterror's assault, and she will guard Mondstadt with her life as always.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200616/2020061611214389168.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=0",
            "element": "Anemo",
            "weapon": "Sword",
            "rating": 512
        },
        {
            "id": 12,
            "name": "Kaeya",
            "quote": "A knight's duty goes beyond the sword.",
            "cv": "Toriumi Kohsuke",
            "description": "In the Knights of Favonius, Kaeya is the most trusted aide for the Acting Grand Master Jean. You can always count on him to solve any intractable problems. Everyone in Mondstadt loves Kaeya, but no one knows what secrets this witty, charming knight has...",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20191009/2019100910335338023.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=3",
            "element": "Cryo",
            "weapon": "Sword",
            "rating": 4
        },
        {
            "id": 13,
            "name": "Keqing",
            "quote": "Hmph. Let's be real here, does Rex Lapis really know everything?",
            "cv": "Saito Soma",
            "description": "The Yuheng of the Liyue Qixing. Keqing has much to say about Rex Lapis' unilateral approach to policymaking in Liyue ⁠— but in truth, gods admire skeptics such as her quite a lot. She firmly believes that humanity's future should be determined by humans themselves, and that they can even do better than the archons and adepti have done for them. In order to prove this, she works harder than anyone else.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200828/2020082817192486254.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=7",
            "element": "Electro",
            "weapon": "Sword",
            "rating": 512
        },
        {
            "id":14,
            "name": "Klee",
            "quote": "I wanna go out and play! Come on, take me out to play already!",
            "cv": "Kuno Misaki",
            "description": "An alchemist with an insatiable curiosity towards the world and everything in it. Attached to the Knights of Favonius as an assistant to Albedo, her area of focus is 'bio-alchemy.' She strives to enrich the world by transforming living things with the power of alchemy. Granted, the products of her research sometimes prove to be more weird than wonderful — but on the whole, she has made monumental contributions to the field of bio-alchemy.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200103/2020010310582722822.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=8",
            "element": "Pyro",
            "weapon": "Catalyst",
            "rating": 5
        },
        {
            "id":15,
            "name": "Lisa",
            "quote": "There'll be time for this later... Come sit and chat with me.",
            "cv": "Tanaka Rie",
            "description": "She is an intellectual witch who can never get enough naps. As the Librarian of the Knights of Favonius, Lisa is smart in that she always knows exactly what to do with whatever troubles her. As much as she loves her sleep, she still manages to keep everything under control in a calm, composed manner.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20191009/2019100915122465321.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=2",
            "element": "Electro",
            "weapon": "Catalyst",
            "rating": 4
        },
        {
            "id": 16,
            "name": "Mona",
            "quote": "Fate is called as such, for it cannot be changed, nor can it be reversed. It can only but be accepted.",
            "cv": "Kohara Konomi",
            "description": "A mysterious young astrologer who proclaims herself to be 'Astrologist Mona Megistus,' and who possesses abilities to match the title. Erudite, but prideful. Though she is often strapped for cash and lives a life of thrift, she is resolved to never use astrology for profit... It is this very resolution that has caused her to constantly fret about money.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200828/2020082817270842074.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=13",
            "element": "Hydro",
            "weapon": "Catalyst",
            "rating": 5
        },
        {
            "id": 17,
            "name": "Ningguang",
            "quote": "Every Mora counts, down to the very last one.",
            "cv": "Ohara Sayaka",
            "description": "Owner of the Jade Chamber in the skies above Liyue, there are stories abound about Ningguang, with her elegance and mysterious smile. As the Tianquan of the Liyue Qixing, not only does she embody law and order, she also represents fortune and wit.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200305/2020030519413867244.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=2",
            "element": "Geo",
            "weapon": "Catalyst",
            "rating": 4
        },
        {
            "id":18,
            "name": "Noelle",
            "quote": "Leave it to me! All of it, whatever it is!",
            "cv": "Takao Kanon",
            "description": "Like most of Mondstadt's young people, Noelle always dreamed of being a knight of Favonius when she grew up. She may not have what it takes to be a knight just yet, but she is learning. Working as a maid at the Knights' headquarters, she is constantly taking notes on what constitutes knightly speech, knightly conduct, and knightly customs. She holds firm to her belief that one day she will join their ranks — she just needs to keep trying her hardest at everything she does.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200315/2020031517331523512.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=10",
            "element": "Geo",
            "weapon": "Claymore",
            "rating": 4
        },
        {
            "id": 19,
            "name": "Qiqi",
            "quote": "I am Qiqi. I am a zombie. And I forgot what comes next.",
            "cv": "Tamura Yukari",
            "description": "An apprentice and herb gatherer at Bubu Pharmacy. \"Blessed\" by the adepti with a body that cannot die, this petite zombie cannot do anything without first giving herself orders to do it. Qiqi's memory is like a sieve. Out of necessity, she always carries around a notebook in which she writes anything important that she is sure to forget later. But on her worst days, she even forgets to look at her notebook...",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200828/2020082817145380161.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=6",
            "element": "Cryo",
            "weapon": "Sword",
            "rating": 5
        },
        {
            "id":20,
            "name": "Razor",
            "quote": "The wolves are my Lucipal. My family.",
            "cv": "Uchiyama Kouki",
            "description": "Some say he is an orphan raised by wolves. Others say he is a wolf spirit in human form. He is most at home in the wild, fighting with claw and thunder. To this day the wolf boy can be found prowling the forest, where he and his wolf pack hunt to survive using nothing more than their animal instincts.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20191028/2019102814495922891.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=6",
            "element": "Electro",
            "weapon": "Claymore",
            "rating": 4
        },
        {
            "id": 21,
            "name": "Sucrose",
            "quote": "And this one is called.. Mist Flower Project 3, Version 17, Enlargement Trial.",
            "cv": "Fujita Akane",
            "description": "An alchemist with an insatiable curiosity towards the world and everything in it. Attached to the Knights of Favonius as an assistant to Albedo, her area of focus is 'bio-alchemy.' She strives to enrich the world by transforming living things with the power of alchemy. Granted, the products of her research sometimes prove to be more weird than wonderful — but on the whole, she has made monumental contributions to the field of bio-alchemy.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200723/2020072319115159476.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=12",
            "element": "Anemo",
            "weapon": "Catalyst",
            "rating": 4
        },
        {
            "id": 22,
            "name": "Venti",
            "quote": "Perfect timing, Traveler! Tell me -- what is your greatest wish?",
            "cv": "Murase Ayumu",
            "description": "A bard that seems to have arrived on some unknown wind — sometimes sing songs as old as the hills, and other times sing poems fresh and new. Likes apples and lively places, but is not a fan of cheese or anything sticky. When using his Anemo power to control the wind, it often appears as feathers, as he's fond of that which appears light and breezy.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20191122/2019112210305833310.png",
            "city": "Mondstadt",
            "url": "https://genshin.mihoyo.com/en/character/mondstadt?char=7",
            "element": "Anemo",
            "weapon": "Bow",
            "rating": 5
        },
        {
            "id": 23,
            "name": "Xiangling",
            "quote": "Sit anywhere you like. I can make whatever you want, even if it's not on the menu!",
            "cv": "Ozawa Ari",
            "description": "The Head Chef at the Wanmin Restaurant and also a waitress there, Xiangling is extremely passionate about cooking and excels at her signature hot and spicy dishes. Though still young, Xiangling is a true master of the culinary arts with all the skills of a kitchen veteran. She enjoys a good reputation among the hearty eaters at Chihu Rock. There's absolutely no need to be nervous if she wants you to sample her latest creation. It will not disappoint. Promise.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200316/2020031618224235129.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=3",
            "element": "Pyro",
            "weapon": "Polearm",
            "rating": 4
        },
        {
            "id": 24,
            "name": "Xiao",
            "quote": "I'm willing to protect you. But don't think about getting close, and stay out of my way, or all that awaits you is regret.",
            "cv": "Matsuoka Yoshitsugu",
            "description": "One of the 'Mighty and Illuminated Adepti' guarding Liyue, also heralded as the 'Guardian yaksha.' Despite his appearance as a young man, occasional legends about him have been documented in ancient books for thousands of years. He is especially fond of Wangshu Inn's Almond Tofu. The reason is that the dish tastes just like the 'dreams' he used to devour.",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200220/2020022013243158838.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=0",
            "element": "Anemo",
            "weapon": "Polearm",
            "rating": 5
        },
        {
            "id": 25,
            "name": "Xingqiu",
            "quote": "A moment of solitude. What could be better?",
            "cv": "Minagawa Junko",
            "description": "Second son of the Feiyun Commerce Guild, Xingqiu has had a reputation for being studious and polite ever since he was a young child. But there is another side to the mild-mannered Xingqiu everyone knows. A daring, adventurous and much more mischievous side...",
            "image": "https://uploadstatic-sea.mihoyo.com/contentweb/20200324/2020032418063418099.png",
            "city": "Liyue",
            "url": "https://genshin.mihoyo.com/en/character/liyue?char=4",
            "element": "Hydro",
            "weapon": "Sword",
            "rating": 4
        },
        {
            "id": 25,
            "name": "Xinyan",
            "quote": "I will bring the order!",
            "cv": "Yaxin Wang",
            "description": "Liyue's sole rock 'n' roll musician. She rebels against ossified prejudices using her music and passionate singing. Xinyan's performances can get so intense that her impromptu stage is set ablaze, often burning the surroundings. Xinyan insists that these pyrotechnics are the apex of performative art, and that they are physical phenomena that have nothing to do with her Vision.",
            "image": "https://static.wikia.nocookie.net/gensin-impact/images/c/c8/Character_Xinyan_Portrait.png/revision/latest/scale-to-width-down/602?cb=20201019184357",
            "city": "Liyue",
            "url": "https://genshin-impact.fandom.com/wiki/Xinyan",
            "element": "Pyro",
            "weapon": "Claymore",
            "rating": 4
        }
    ]
}